## 对象的增删改查

In [1]:
import pandas as pd

### Series结构的增删改查

In [3]:
data = [10,11,12]
index = ['a','b','c']
s = pd.Series(data=data, index=index)
s

a    10
b    11
c    12
dtype: int64

#### 查

In [4]:
s[0]

10

In [6]:
s['a']

10

In [8]:
s[0:3]

a    10
b    11
c    12
dtype: int64

In [9]:
mask=[True,False,True]
s[mask]

a    10
c    12
dtype: int64

In [10]:
s.loc['b']

11

In [14]:
s.iloc[1]

11

#### 改

In [25]:
s1 = s.copy()
s1['a'] = 100
s1

a    100
b     11
c     12
dtype: int64

In [19]:
s1.replace(to_replace=100, value=101, inplace=True)
s1

a    101
b     11
c     12
dtype: int64

In [20]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [21]:
s1.index = ['a', 'b', 'd']
s1

a    101
b     11
d     12
dtype: int64

In [22]:
s1.rename(index={'a': 'A'}, inplace=True)
s1

A    101
b     11
d     12
dtype: int64

#### 增

In [23]:
data = [100,110]
index = ['h','k']
s2 = pd.Series(data = data,index = index)
s2

h    100
k    110
dtype: int64

In [32]:
s2['j'] = 300
s2

h    100
k    110
j    300
dtype: int64

#### 删

In [36]:
s1['j'] = 110
s1

a    100
b     11
c     12
j    110
dtype: int64

In [35]:
del s1['j']
s1

a    100
b     11
c     12
dtype: int64

In [38]:
s1.drop(['j'], inplace=True)
s1

a    100
b     11
c     12
dtype: int64

### DataFrame结构的增删改查

In [39]:
data = [[1,2,3],[4,5,6]]
index = ['a','b']
columns = ['A','B','C']

df = pd.DataFrame(data=data,index=index,columns = columns)
df

   A  B  C
a  1  2  3
b  4  5  6

#### 查

In [41]:
df['B']

a    2
b    5
Name: B, dtype: int64

In [43]:
df.iloc[1]

A    4
B    5
C    6
Name: b, dtype: int64

In [44]:
df.loc['a']

A    1
B    2
C    3
Name: a, dtype: int64

#### 改

In [45]:
df.loc['a']['B']

2

In [46]:
df.loc['a']['B'] = 5
df

   A  B  C
a  1  5  3
b  4  5  6

In [47]:
df.index

Index(['a', 'b'], dtype='object')

In [48]:
df.index = ['a', 'c']
df

   A  B  C
a  1  5  3
c  4  5  6

#### 增

In [51]:
df.loc['d'] = ['7','8','9']
df

   A  B  C
a  1  5  3
c  4  5  6
d  7  8  9

In [52]:
data = [[1,2,3],[4,5,6]]
index = ['j','k']
columns = ['A','B','C']

df2 = pd.DataFrame(data=data,index=index,columns = columns)
df2

   A  B  C
j  1  2  3
k  4  5  6

In [54]:
df3 = pd.concat([df,df2], axis=0)
df3

   A  B  C
a  1  5  3
c  4  5  6
d  7  8  9
j  1  2  3
k  4  5  6

In [57]:
df2

   A  B  C
j  1  2  3
k  4  5  6

In [58]:
df2['D'] = [7,9]
df2

   A  B  C  D
j  1  2  3  7
k  4  5  6  9

#### 删

In [59]:
del df2['D']
df2

   A  B  C
j  1  2  3
k  4  5  6

In [60]:
df2['N'] = [4,1]
df2

   A  B  C  N
j  1  2  3  4
k  4  5  6  1

In [62]:
df2.drop(['N'],axis=1,inplace=True)
df2

   A  B  C
j  1  2  3
k  4  5  6

In [63]:
df2.drop(['k'],axis=0,inplace=True)
df2

   A  B  C
j  1  2  3